# taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask'
tap 'datawire/blackbird'
tap 'knative/client'

# macOS specific
brew "m-cli"

# /Application's
# cask 'alacritty' # !arm64 (compile manually)
cask 'appcleaner'
# cask 'balenaetcher' # !arm64
# cask 'bitwarden' # !arm64
# cask 'discord' # !arm64 (using canary)
# cask 'docker' # !arm64 (using colima)
cask 'firefox'
cask 'fork'
cask 'handbrake'
# cask 'keybase' # !arm64
cask 'postman'
# cask 'signal' # !arm64
cask 'slack'
# cask 'virtualbox-extension-pack' # !arm64
# cask 'virtualbox' # !arm64
cask 'visual-studio-code'

# mac app store
mas 'Bear', id: 1091189122
mas 'Home Assistant', id: 1099568401
mas 'WireGuard', id: 1451685025

# these are here cause in nixpkgs they either:
# - do not exist
# - are not up to date
# - do not work on darwin
brew 'awscli'
brew 'cloudflare-wrangler'
brew 'datawire/blackbird/telepresence'
brew 'k3d'
brew 'knative/client/kn'
brew 'rbenv'
brew 'velero'
brew 'waypoint'

# fonts
brew 'subversion' # some fonts require this
cask 'font-ibm-plex-mono'
cask 'font-victor-mono-nerd-font'
